sprindy/yyb/rtos/nrf51822/beacon/nrf51_beacon/ble_app_beacon/drivers/display/display.c
	}
}

/* length is 20, the last 16 are for display */
void display_update_data(uint8_t *p_buf, uint8_t length)
{
	if(p_buf == NULL) {
		log_d("[DISP] no data!\n");
		return;
	}

	static uint8_t package_num = 0;
	uint8_t index = p_buf[1];
	uint16_t len = length - 4;
	uint16_t len_add = display_rcv_word_cnt * 4 * DISPLAY_LED_NUM;
	/* log_d("[DISP] %s index=%d, len=%d. cnt=%d, len_add=%d\n", __func__, */
			/* index, len, display_rcv_word_cnt, len_add); */
	for(int i=0; i<len; i++ ) {
		wData[index * len + len_add + i] = p_buf[4+i];
	}
	if(++package_num >= 8) {
		package_num = 0;
		if( ++display_rcv_word_cnt >= DISPLAY_WORDS_CNT) {
			display_rcv_word_cnt = 0;
		}
	}
}

void display_one_line(uint32_t line_data)
{
	static uint32_t tmp = 0;
	/* static uint8_t i = DISPLAY_LED_NUM - 1; */
	static uint8_t i = 0;
	/* for(uint8_t i=0; i<DISPLAY_LED_NUM, i++) */
	{
		tmp = line_data & (1 << (DISPLAY_LED_NUM - 1 - i));
		display_turn_led_on(i, (tmp != 0));
	}
	if(++i >= DISPLAY_LED_NUM)
		i = 0;
}

uint32_t display_timer_start(void)
{
	uint32_t err_code = NRF_SUCCESS;
#if ENABLE_DISPLAY_TIMER
    if (!m_display_ct.timer_running) {
        err_code = app_timer_start(m_display_ct.timer_id, DISPLAY_TIMER_PERIOD, NULL);
		APP_ERROR_CHECK(err_code);
        if (err_code != NRF_SUCCESS) {
			log_d("[DISP] display timer start fail\n");
            return err_code;
        }
			log_d("[DISP] display timer start sucess\n");

        m_display_ct.timer_running = true;
    }

#endif
    return err_code;
}

uint32_t display_timer_stop(void)
{
	uint32_t err_code = NRF_SUCCESS;
#if ENABLE_DISPLAY_TIMER
    if (m_display_ct.timer_running) {
        err_code = app_timer_stop(m_display_ct.timer_id);
        if (err_code != NRF_SUCCESS) {
			log_d("[DISP] display timer stop fail\n");
            return err_code;
        }
			log_d("[DISP] display timer stoped \n");

        m_display_ct.timer_running = false;
    }

#endif
    return err_code;
}
uint32_t display_change_direction(bool dir)
{
	if(dir) {
		display_dir = true;
#if DISPLAY_ONE_WORD
		display_cur_line = display_cur_word * DISPLAY_LED_NUM;

		if(++display_cur_word >= sizeof(wData)/4/DISPLAY_LED_NUM) {
			display_cur_word = 0;

			display_repeat_cnt = 0;
			/* display_timer_start(); */
		}
#else
		display_cur_line = 0;
#endif
	}
	else {
		display_dir = false;
#if DISPLAY_ONE_WORD
		display_cur_line = (display_cur_word+1) * DISPLAY_LED_NUM - 1;
#else
		display_cur_line = sizeof(wData)/4 - 1;
#endif
	}

	return 0;
}

uint32_t display_get_repeat_cnt(void)
{
	return display_repeat_cnt;
}

static void display_work_timerout(void *p_context)
{
#if DISPLAY_LED_TEST
	/* only for led test */
	static uint8_t i = 0;
	/* if (i++ <= DISPLAY_LED_NUM - 1) { */
	/* if (i <= 1) { */
	if(1) {
		display_turn_led_on(1, true);
		/* uint8_t buf=nrf_gpio_word_byte_read(&NRF_GPIO->PIN_CNF[4], 2); */
		/* log_d("[DISP] %s %d\n",__func__, i); */
		/* log_d("[DISP] %s %d 0x%2x\n",__func__, i, buf); */
		/* ble_log_d("[DISP] %s %d 0x%2x\n",__func__, i, buf); */
		/* i++; */
	}
	else
		i = 0;
#else
	static uint32_t cnt_line = 0;
	static uint32_t tmp = 0x0;
	/* if (i++ <= DISPLAY_LED_NUM - 1) { */
	{
		display_one_line(tmp);
	}

	if(cnt_line%(DISPLAY_LED_NUM * DISPLAY_LINE_DELAY) == 0) {
		if(cnt_line%(DISPLAY_LED_NUM << 4) == 0) {
			/* log_d("[DISP] l:%3d cnt:%8d, t:0x%x\n", display_cur_line, cnt_line, tmp); */
			ble_printf(&wData[display_cur_line], 4);
			if(display_repeat_cnt++ > 80) {
				/* display_timer_stop(); */
			}
		}

		tmp = 0;
		if(display_cur_line >= sizeof(wData)/4) {
			return;
		}
		if(display_cur_line < 0) {
			return;
		}
		if(display_dir == false) {
			tmp |= wData[display_cur_line*4]<<24;
			tmp |= wData[display_cur_line*4+1]<<16;
			tmp |= wData[display_cur_line*4+2]<<8;
			tmp |= wData[display_cur_line*4+3];
#if DISPLAY_ONE_WORD
			if(++display_cur_line >= (display_cur_word+1) * DISPLAY_LED_NUM) {
				display_cur_line = display_cur_word * DISPLAY_LED_NUM;
			}
#else
			if(++display_cur_line >= sizeof(wData)/4) {
				display_cur_line = 0;
			}
#endif
		}
		else {
			tmp |= wData[display_cur_line*4]<<24;
			tmp |= wData[display_cur_line*4+1]<<16;
			tmp |= wData[display_cur_line*4+2]<<8;
			tmp |= wData[display_cur_line*4+3];
#if DISPLAY_ONE_WORD
			if(--display_cur_line < display_cur_word * DISPLAY_LED_NUM) {
				display_cur_line = (display_cur_word+1) * DISPLAY_LED_NUM - 1;
			}
#else
			if(display_cur_line-- == 0) {
				display_cur_line = sizeof(wData)/4 - 1;
			}
#endif
		}
	}

	cnt_line++;
#endif
}

static uint32_t display_timer_init(void)
{
	uint32_t err_code;

#if ENABLE_DISPLAY_TIMER
	m_display_ct.timer_running = false;
	err_code = app_timer_create(&m_display_ct.timer_id, APP_TIMER_MODE_REPEATED, display_work_timerout);
	APP_ERROR_CHECK(err_code);
	if(err_code != NRF_SUCCESS) {
		log_d("[DISP] create display timer fail\n");
	}
	else {
		log_d("[DISP] create display timer sucess\n");
	}
#endif

	return err_code;
}

const nrf_drv_timer_t TIMER_LED = NRF_DRV_TIMER_INSTANCE(0);
/**
 * @brief Handler for timer events.
 */
void timer_led_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    static uint32_t i;
    /* uint32_t led_to_invert = ((i++) % LEDS_NUMBER); */

    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE0:
			nrf_gpio_cfg_output(LED_RGB_RED);
			if(nrf_gpio_pin_read(LED_RGB_RED))
				nrf_gpio_pin_clear(LED_RGB_RED);
			else
				nrf_gpio_pin_set(LED_RGB_RED);

            /* bsp_board_led_invert(led_to_invert); */
            break;

        default:
            //Do nothing.
            break;
    }
}

static uint32_t display_drv_timer_init(void)
{
    uint32_t time_ms = 500; //Time(in miliseconds) between consecutive compare events.
    uint32_t time_ticks;
    uint32_t err_code = NRF_SUCCESS;

    //Configure TIMER_LED for generating simple light effect - leds on board will invert his state one after the other.
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&TIMER_LED, &timer_cfg, timer_led_event_handler);
	APP_ERROR_CHECK(err_code);

    time_ticks = nrf_drv_timer_ms_to_ticks(&TIMER_LED, time_ms);

    nrf_drv_timer_extended_compare(
         &TIMER_LED, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    nrf_drv_timer_enable(&TIMER_LED);

	return err_code;
}

uint32_t display_init(void)
{
	uint32_t err_code;

	/* nrf_gpio_cfg_output(DISPLAY_GPIO_0); */
	nrf_gpio_cfg_output(DISPLAY_GPIO_0);
	nrf_gpio_cfg_output(DISPLAY_GPIO_1);
	nrf_gpio_cfg_output(DISPLAY_GPIO_2);
	nrf_gpio_cfg_output(DISPLAY_GPIO_3);
	nrf_gpio_cfg_output(DISPLAY_GPIO_4);
	nrf_gpio_cfg_output(DISPLAY_GPIO_5);
	nrf_gpio_cfg_output(DISPLAY_GPIO_6);
	nrf_gpio_cfg_output(DISPLAY_GPIO_7);

	nrf_gpio_pin_clear(DISPLAY_GPIO_0);
	nrf_gpio_pin_clear(DISPLAY_GPIO_1);
	nrf_gpio_pin_clear(DISPLAY_GPIO_2);
	nrf_gpio_pin_clear(DISPLAY_GPIO_3);
	nrf_gpio_pin_clear(DISPLAY_GPIO_4);
	nrf_gpio_pin_clear(DISPLAY_GPIO_5);
	nrf_gpio_pin_clear(DISPLAY_GPIO_6);
	nrf_gpio_pin_clear(DISPLAY_GPIO_7);

	/* err_code = display_drv_timer_init(); */
	err_code = display_timer_init();
	if(err_code == NRF_SUCCESS) {
		err_code = display_timer_start();
	}

	return err_code;
} 
